RIET/src/DataProcessors/PullWONoFromTMS/PullWONoFromTMS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>PullWONoFromTMS</name>
</mdclass:DataProcessor>

RIET/src/InformationRegisters/OBNoQueue/OBNoQueue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>OBNoQueue</name>
  <dimensions>
    <name>OBNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/OBNoAndWONo/OBNoAndWONo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>OBNoAndWONo</name>
  <resources>
    <name>WO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>OBNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/Trip/Trip.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Trip</name>
  <registerRecords>AccumulationRegister.LocalDistributionCostsMilageWeightVolume</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerItem</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerKG</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionAccessorialCostsPerItem</registerRecords>
  <attributes>
    <name>WarehouseFrom</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Draft</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Final</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Equipment</name>
    <type>
      <types>CatalogRef.Equipments</types>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseToList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysETAWithoutATA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroBaseCostsSum</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSumSLBUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransport</name>
    <type>
      <types>EnumRef.TypesOfTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </attributes>
  <attributes>
    <name>DontSendInTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FinalDestinations</name>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>Waybill</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ETA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ATA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DomesticOB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Urgency</name>
      <type>
        <types>EnumRef.Urgencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Gold</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Costs</name>
    <attributes>
      <name>CostType</name>
      <type>
        <types>CatalogRef.AccessorialCosts</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/DataProcessors/PullWONoFromTMS/Forms/Форма/Module.bsl
&НаКлиенте
Процедура PullDataFromTMS(Команда)
	
	PullDataFromTMSНаСервере(Период.ДатаНачала, Период.ДатаОкончания);
	Элементы.OBQueue.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура PullDataFromTMSНаСервере(ДатаНачала, ДатаОкончания)
	
	Таймаут = 2;
	Обработки.PullWONoFromTMS.PullDataFromTMS(Таймаут, ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура FillQueue(Команда)
	
	FillQueueНаСервере();
	Элементы.OBQueue.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура FillQueueНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	TripDomesticOB.OBNo
		|ИЗ
		|	Документ.Trip.DomesticOB КАК TripDomesticOB
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoQueue КАК OBNoQueue
		|		ПО TripDomesticOB.OBNo = OBNoQueue.OBNo
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
		|		ПО TripDomesticOB.OBNo = OBNoAndWONo.OBNo
		|ГДЕ
		|	OBNoQueue.OBNo ЕСТЬ NULL 
		|			И OBNoAndWONo.OBNo ЕСТЬ NULL ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	НЗ = РегистрыСведений.OBNoQueue.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НЗ.Очистить();
		НЗ.Отбор.OBNo.Установить(ВыборкаДетальныеЗаписи.OBNo);
		Запись = НЗ.Добавить();
		Запись.OBNo = ВыборкаДетальныеЗаписи.OBNo;
		НЗ.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ClearQueue(Команда)
	
	ClearQueueНаСервере();
	Элементы.OBQueue.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ClearQueueНаСервере()
	
	НЗ = РегистрыСведений.OBNoQueue.СоздатьНаборЗаписей();
	НЗ.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура UpdateQueueStatistics(Команда)
	
	UpdateQueueStatisticsНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура UpdateQueueStatisticsНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(TripDomesticOB.Ссылка.Дата, МЕСЯЦ) КАК Месяц,
	|	TripDomesticOB.Ссылка.Дата КАК Дата,
	|	OBNoQueue.OBNo КАК OBNo,
	|	TripDomesticOB.Ссылка КАК Trip
	|ИЗ
	|	РегистрСведений.OBNoQueue КАК OBNoQueue
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|		ПО OBNoQueue.OBNo = TripDomesticOB.OBNo
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ OBNo),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Trip)
	|ПО
	|	Месяц";
	
	ДЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(ДЗ, "QueueStatistics");
	
КонецПроцедуры

&НаКлиенте
Процедура UpdateResultStatistics(Команда)
	
	UpdateResultStatisticsНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура UpdateResultStatisticsНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(TripDomesticOB.Ссылка.Дата, МЕСЯЦ) КАК Месяц,
	|	TripDomesticOB.Ссылка.Дата КАК Дата,
	|	OBNoAndWONo.OBNo КАК OBNo,
	|	TripDomesticOB.Ссылка КАК Trip
	|ИЗ
	|	РегистрСведений.OBNoAndWONo КАК OBNoAndWONo
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Trip.DomesticOB КАК TripDomesticOB
	|		ПО OBNoAndWONo.OBNo = TripDomesticOB.OBNo
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ OBNo),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Trip)
	|ПО
	|	Месяц";
	
	ДЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЗначениеВРеквизитФормы(ДЗ, "ResultStatistics");
	
КонецПроцедуры
